---
kind: property
id: P:Autodesk.Revit.DB.NavisworksExportOptions.IsValidObject
source: html/81d64aca-5b15-956f-fd76-5f3ae00084fe.htm
---
# Autodesk.Revit.DB.NavisworksExportOptions.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.